package prog.classes;
import java.text.DecimalFormat;
import java.util.Random;

public class Discrete_var {
    double []x1 = new double[2];
    int []x2 = new int[2];
    int x31;
    double x32;
    int []x4 = new int[5];
    double []x5 = new double[4];
    public Discrete_var() {
        Random rn = new Random();
        x1[0] = (rn.nextInt(8)+1)/10.0;
        x1[1] = (rn.nextInt(8)+1)/10.0;

        x2[0] = rn.nextInt(5)+1;
        x2[1] = rn.nextInt(3)+3;

        x31 = (rn.nextInt(6)+2)*1000;
        x32 = (rn.nextInt(8)+1)/10000.0;

        x4[0] = rn.nextInt(5)+1;
        x4[1] = rn.nextInt(5)+1;
        x4[2] = rn.nextInt(5)+x4[1]+1;
        x4[3] = rn.nextInt(5)+1;
        x4[4] = rn.nextInt(5)+x4[2]+1;

        x5[0] = (rn.nextInt(5)+1)/10.0;
        x5[1] = (rn.nextInt(3)+1)/10.0;
        x5[2] = (rn.nextInt(8)+1)/10.0;
        x5[3] = 1.0 - x4[3];
    }
    public String getText() {
        String s = "Глава 5. Дискретные случайные величины\n";
        s += "1. Из двух орудий поочередно ведется стрельба по цели до первого попадания одним из орудий. Вероятность попадания в цель для первого " +
                "орудия равна "+x1[0]+", для второго — "+x1[1]+". Начинает стрельбу первое орудие. Составить ряд распределения дискретной случайной величины " +
                "X — числа снарядов, израсходованных первым орудием. Найти М(Х), D(X), (X), F(X) этой случайной величины. Построить график F(X).\n";
        s += "2. Составить ряд распределения числа выпадений числа "+x2[0]+", если игральная кость брошена "+x2[1]+" раза. Найти M(X) и D(X) этой случайной величины.\n";
        s += "3. Завод отправил на базу "+x31+" доброкачественных изделий. Вероятность того, что в пути изделие повредится, равна "+x32+". Составить ряд " +
                "распределения числа негодных изделий, прибывших на базу. Найти M(X) этой случайной величины.\n";
        s += "4. Независимые случайные величины X и Y заданы таблицами распределений. Найти: \n" +
                "1) M(X), M(Y), D(X), D(Y); \n" +
                "2) таблицы распределения случайных величин Z1 = = 2X+Y, Z2 = X+Y; \n" +
                "3) M(Z1), M(Z2), D(Z1), D(Z2) непосредственно по таблицам распределений и на основании свойств математического ожидания и дисперсии.\n" +
                "X | -"+x4[0]+" |  "+x4[1]+"  |  "+x4[2]+"     Y |  "+x4[3]+"  |  "+x4[4]+"\n"+
                "P |  p | "+x5[0]+" | "+x5[1]+"    P | "+x5[0]+" | "+x5[1]+"\n\n";
        return s;
    }
    public String getAns() {
        DecimalFormat df = new DecimalFormat("0.000");
        String s = "Глава 5\n";
        double t1 = 1-x1[0]*x1[1], t2 = x1[0]*x1[1];
        s += "1. M(X) = " + df.format(1.0/t1);
        double m2 = t1*((1+t2)/Math.pow(1-t2,3));
        s += "\n   D(X) = " + df.format(m2 - Math.pow(1.0/t1,2));
        s += "\n   o'(x) = " + df.format(Math.sqrt(m2 - Math.pow(1.0/t1,2)));
        s += "\n3. M(X) = " + df.format(x31*x32) + "\n";
        return s;
    }
}
