import java.math.BigInteger;
import java.util.Random;

public class Combinatory {
    private int []x1 = new int[2];
    private int []x2 = new int[6];
    Combinatory(){
        Random rn = new Random();
        x1[0] = rn.nextInt(5)+5;
        x1[1] = rn.nextInt(x1[0]-3)+2;
        x2[0] = rn.nextInt(15)+15;
        x2[1] = x2[0]/2 + rn.nextInt(2)-1;
        x2[2] = x2[1]/2 + rn.nextInt(2)+2;
        x2[3] = x2[2] - (rn.nextInt(2)+1);
        x2[4] = x2[3] - (rn.nextInt(2)+1);
        x2[5] = x2[3] - (rn.nextInt(2)+1);
    }
    String getText() {
        String s = "Глава 1. Комбинаторика\n";
        s += "1. У " + x1[0] + " спортсменов кроссовки разных размеров. " +
                "После душа в темной раздевалке каждый выбрал себе кроссовки наугад. " +
                "Найти вероятность того, что:\nа) все кроссовки достанутся своим хозяевам; " +
                "\nб) " + x1[1] + " пар(ы) кроссовок достанутся своим хозяевам.\n";
        s += "2. В читальном зале библиотеки на полке стоит " + x2[0] + " справочников, в том числе "+x2[1]+" — по математике, " +
                "и в "+x2[2]+" из них содержатся нужные студенту сведения. Студент наудачу набирает "+x2[3]+" справочников. " +
                "Найти вероятность того, что:\nа) в "+x2[4]+" из них содержится нужная информация;\n" +
                "б) студент выберет "+x2[5]+" справочника по математике, а нужная информация будет в одном из них.\n\n";
        return s;
    }
    String getAns() {
        String s = "";
        s += "Глава 1\n";
        s += "1. a) 1/" + Funct.factorial(x1[0]);
        s += "\n   b) 1/" + Funct.factorial(x1[0]-x1[1]);
        s += "\n2. a) (C("+x2[2]+", "+x2[4]+") * C("+(x2[0]-x2[2])+", "+(x2[3]-x2[4])+")) / C("+x2[0]+", "+x2[3]+")";
        s += "\n   b) (C("+x2[2]+", "+1+") * C("+(x2[1]-x2[2])+", "+(x2[5]-1)+") * C("+(x2[0]-x2[1])+", "+(x2[3]-x2[5])+")) / C("+x2[0]+", "+x2[3]+")";
        s += "\n";
        return s;
    }
}
